#include <iostream>

using namespace std;

int main()
{
	//Задані три опори R1, R2, R3. Обчислити
	//значення опору R0 за формулою : 1 / R0 = 1 / R1 + 1 / R2 + 1 / R3.
	//Контрольний приклад : R1 = 2, R2 = 4, R3 = 8 R0 = 1.142857.

	cout << "No. 1" << endl;
	float R1, R2, R3;
	cout << "R1, R2, R3: ";
	cin >> R1 >> R2 >> R3;
	float R0 = 1 / (1 / R1 + 1 / R2 + 1 / R3);
	cout << "R0: " << R0 << endl;

	//Завдання 2. За заданою довжиною окружності знайти
	//площу кола за формулою S = pi * R2, радіус обчислити
	//з формули довжини кола : L = 2 * pi * R.
	//Примітка : pi = 3.14.

	cout << endl << "No. 2" << endl;
	float pi = 3.14;
	float S, R, L;
	cout << "L : ";
	cin >> L;
	R = L / (2 * pi);
	S = pi * R * R;
	cout << "S : " << S << ", R : " << R << endl;

	//Завдання 3. Обчислити пройдену відстань при прямо -
	//лінійному рівноприскореному русі за формулою S = v * t
	//+ (a * t2) / 2, де v — швидкість, t — час, а — прискорення.

	cout << endl << "No. 3" << endl;
	float v, t, a, s;
	cout << "v, t, a: ";
	cin >> v >> t >> a;
	s = v * t + (a * t * t) / 2;
	cout << "S : " << s << endl;

}
